yosys -import
setundef -zero
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/AMOALU.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/Arbiter2_Valid_PTWReq.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/Arbiter3_LLWB.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/AsyncQueueSink_DebugInternalBundle.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/AsyncQueueSink_Phit.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/AsyncQueueSink_TLBundleA_a9d32s1k1z2u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/AsyncQueueSink_TLBundleD_a9d32s1k1z2u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/AsyncQueueSource_DebugInternalBundle.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/AsyncQueueSource_Phit.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/AsyncQueueSource_TLBundleA_a9d32s1k1z2u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/AsyncQueueSource_TLBundleD_a9d32s1k1z2u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/AsyncQueue.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/AsyncResetRegVec_w1_i0.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/AsyncResetRegVec_w1_i1.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/AsyncResetRegVec_w2_i0.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/AsyncResetSynchronizerPrimitiveShiftReg_d3_i0.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/AsyncResetSynchronizerShiftReg_w1_d3_i0_1.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/AsyncResetSynchronizerShiftReg_w1_d3_i0.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/AsyncResetSynchronizerShiftReg_w4_d3_i0.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/AsyncValidSync.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/bootromClockSinkDomain.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/BreakpointUnit.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/BundleBridgeNexus_UInt1_2.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/CaptureChain_JTAGIdcodeBundle.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/CaptureUpdateChain_DMIAccessCapture_To_DMIAccessUpdate.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/CaptureUpdateChain_DTMInfo_To_DTMInfo.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/CaptureUpdateChain_UInt5_To_UInt5.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/ChipTop.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/ChipyardPRCICtrlClockSinkDomain.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/CLINTClockSinkDomain.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/CLINT.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/ClockCrossingReg_w15.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/ClockCrossingReg_w32.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/ClockCrossingReg_w43.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/ClockCrossingReg_w55.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/ClockGroupAggregator_allClocks.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/ClockGroupAsyncResetCoercer.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/ClockGroupCombiner.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/ClockGroupResetSynchronizer.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/CSRFile.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/DCacheDataArray.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/DCache.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/DebugTransportModuleJTAG.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/DecoupledSerialPhy.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/DigitalTop.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/DMIToTL.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/EICG_wrapper.v
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/ErrorDeviceWrapper.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/FixedClockBroadcast_2.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/FixedClockBroadcast_4.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/FixedClockBroadcast_7.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/FlitToPhit_f32_p32.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/FrontBus.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/Frontend.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/GenericDeserializer_TLBeatw10_f32.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/GenericDeserializer_TLBeatw67_f32.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/GenericDeserializer_TLBeatw87_f32.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/GenericDeserializer_TLBeatw88_f32.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/GenericDigitalInIOCell.v
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/GenericDigitalOutIOCell.v
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/GenericSerializer_TLBeatw67_f32.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/GenericSerializer_TLBeatw87_f32.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/HellaCacheArbiter.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/IBuf.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/ICache.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/InferredResetSynchronizerPrimitiveShiftReg_d3_i0.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/IntSyncAsyncCrossingSink_n1x1.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/IntSyncCrossingSource_n1x1_Registered.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/IntSyncCrossingSource_n1x1.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/IntSyncCrossingSource_n1x2.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/IntSyncSyncCrossingSink_n1x1.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/IntSyncSyncCrossingSink_n1x2.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/IntXbar_i3_o1.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/ITLB.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/JtagBypassChain.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/JtagStateMachine.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/JtagTapController.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/LevelGateway.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/MulDiv.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/NonSyncResetSynchronizerPrimitiveShiftReg_d3.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/OptimizationBarrier_TLBEntryData.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/PeripheryBus_cbus.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/PeripheryBus_pbus.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/PhitArbiter_p32_f32_n5.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/PhitDemux_p32_f32_n5.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/PhitToFlit_p32_f32.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/PLICClockSinkDomain.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/PLICFanIn.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/plusarg_reader.v
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/PlusArgTimeout.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/PMAChecker.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/PMPChecker_s2.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/PTW.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/Queue1_RegMapperInput_i23_m8.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/Queue1_TLBundleA_a14d64s7k1z4u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/Queue1_TLBundleD_a64d64s8k8z8c.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/Queue2_TLBundleA_a14d64s7k1z4u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/Queue2_TLBundleA_a21d64s7k1z3u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/Queue2_TLBundleA_a29d64s7k1z3u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/Queue2_TLBundleA_a32d32s7k1z3u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/Queue2_TLBundleA_a32d64s1k1z4u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/Queue2_TLBundleA_a32d64s4k1z4u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/Queue2_TLBundleA_a32d64s5k1z4u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/Queue2_TLBundleA_a32d64s7k1z4u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/Queue2_TLBundleD_a14d64s7k1z4u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/Queue2_TLBundleD_a21d64s7k1z3u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/Queue2_TLBundleD_a29d64s7k1z3u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/Queue2_TLBundleD_a32d32s7k1z3u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/Queue2_TLBundleD_a32d64s1k1z4u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/Queue2_TLBundleD_a32d64s4k1z4u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/Queue2_TLBundleD_a32d64s5k1z4u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/Queue2_TLBundleD_a32d64s7k1z4u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/Queue2_TLBundleD_a32d8s1k1z4u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/Queue8_Flit.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/Queue8_UInt8.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/ram_2x104.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/ram_2x10.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/ram_2x110.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/ram_2x116.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/ram_2x118.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/ram_2x119.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/ram_2x120.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/ram_2x122.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/ram_2x50.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/ram_2x77.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/ram_2x80.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/ram_2x81.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/ram_2x82.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/ram_2x83.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/ram_2x84.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/ram_8x8.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/ram_flit_8x32.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/Repeater_TLBundleA_a12d64s7k1z3u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/Repeater_TLBundleA_a13d64s7k1z3u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/Repeater_TLBundleA_a17d64s7k1z3u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/Repeater_TLBundleA_a21d64s7k1z3u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/Repeater_TLBundleA_a26d64s7k1z3u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/Repeater_TLBundleA_a28d64s7k1z3u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/Repeater_TLBundleA_a29d64s7k1z3u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/Repeater_TLBundleA_a32d32s7k1z3u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/Repeater_TLBundleA_a32d64s7k1z3u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/Repeater_TLBundleD_a32d64s1k1z4u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/ResetCatchAndSync_d3.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/ResetSynchronizerShiftReg_w1_d3_i0.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/rf_31x32.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/RocketALU.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/Rocket.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/rockettile_dcache_data_arrays_0.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/rockettile_dcache_data_arrays_1.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/rockettile_icache_data_arrays_0_0.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/rockettile_icache_data_arrays_1_0.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/rockettile_icache_tag_array_0.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/RocketTile.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/RVCExpander.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/SBToTL.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/ScratchpadSlavePort.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/SerialTL0ClockSinkDomain.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/ShiftQueue.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/SynchronizerShiftReg_w1_d3.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/SystemBus.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TileClockGater.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TilePRCIDomain.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TileResetSetter.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLAFromBeat_serial_tl_0_a64d64s8k8z8c.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLAsyncCrossingSink_a9d32s1k1z2u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLAsyncCrossingSource_a9d32s1k1z2u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLAtomicAutomata_cbus.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLAtomicAutomata_pbus.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLBFromBeat_serial_tl_0_a64d64s8k8z8c.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLBToBeat_serial_tl_0_a64d64s8k8z8c.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLBuffer_a14d64s7k1z4u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLBuffer_a21d64s7k1z3u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLBuffer_a29d64s7k1z3u_1.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLBuffer_a29d64s7k1z3u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLBuffer_a32d32s7k1z3u_1.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLBuffer_a32d64s1k1z4u_1.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLBuffer_a32d64s4k1z4u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLBuffer_a32d64s5k1z4u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLBuffer_a32d64s7k1z4u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLBusBypassBar.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLBusBypass.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLCFromBeat_serial_tl_0_a64d64s8k8z8c.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLDebugModuleInnerAsync.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLDebugModuleInner.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLDebugModuleOuterAsync.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLDebugModuleOuter.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLDebugModule.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLDFromBeat_serial_tl_0_a64d64s8k8z8c.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLDToBeat_serial_tl_0_a64d64s8k8z8c.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLEFromBeat_serial_tl_0_a64d64s8k8z8c.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLError_1.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLError.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLFragmenter_1.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLFragmenter_BootAddrReg.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLFragmenter_bootrom.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLFragmenter_CLINT.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLFragmenter_Debug.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLFragmenter_PLIC.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLFragmenter_TileClockGater.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLFragmenter_TileResetSetter.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLFragmenter_UART.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLInterconnectCoupler_cbus_to_bootrom.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLInterconnectCoupler_cbus_to_clint.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLInterconnectCoupler_cbus_to_debug.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLInterconnectCoupler_cbus_to_plic.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLInterconnectCoupler_cbus_to_prci_ctrl.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLInterconnectCoupler_cbus_to_rockettile.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLInterconnectCoupler_fbus_from_debug_sb.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLInterconnectCoupler_fbus_from_port_named_serial_tl_0_in.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLInterconnectCoupler_pbus_to_bootaddressreg.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLInterconnectCoupler_pbus_to_device_named_uart_0.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLMonitor_10.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLMonitor_11.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLMonitor_12.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLMonitor_13.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLMonitor_14.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLMonitor_16.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLMonitor_17.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLMonitor_18.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLMonitor_19.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLMonitor_1.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLMonitor_20.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLMonitor_21.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLMonitor_22.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLMonitor_23.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLMonitor_24.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLMonitor_25.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLMonitor_26.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLMonitor_27.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLMonitor_28.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLMonitor_29.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLMonitor_2.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLMonitor_30.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLMonitor_31.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLMonitor_32.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLMonitor_33.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLMonitor_34.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLMonitor_35.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLMonitor_36.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLMonitor_37.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLMonitor_38.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLMonitor_39.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLMonitor_3.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLMonitor_40.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLMonitor_41.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLMonitor_42.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLMonitor_43.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLMonitor_44.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLMonitor_4.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLMonitor_5.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLMonitor_6.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLMonitor_7.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLMonitor_8.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLMonitor_9.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLMonitor.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLPLIC.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLROM.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLSerdesser_serial_tl_0.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLUARTClockSinkDomain.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLUART.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLWidthWidget1.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLWidthWidget8_4.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLXbar_cbus_in_i2_o1_a32d64s7k1z4u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLXbar_cbus_out_i1_o8_a32d64s7k1z4u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLXbar_dmixbar_i1_o2_a9d32s1k1z2u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLXbar_fbus_i2_o1_a32d64s5k1z4u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLXbar_MasterXbar_RocketTile_i2_o1_a32d64s1k1z4u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLXbar_pbus_out_i1_o2_a29d64s7k1z3u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLXbar_prcibus_i1_o2_a21d64s7k1z3u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/TLXbar_sbus_i2_o1_a32d64s6k1z4u.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/UARTRx.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/UARTTx.sv
read_verilog -sv /home/chipyard/chipyard/vlsi/generated-src/chipyard.harness.TestHarness.TinyRocketConfig/gen-collateral/chipyard.harness.TestHarness.TinyRocketConfig.top.mems.v
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_SIMPLE_RVT_TT_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_SIMPLE_RVT_SS_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_SIMPLE_RVT_FF_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_SIMPLE_LVT_TT_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_SIMPLE_LVT_SS_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_SIMPLE_LVT_FF_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_SIMPLE_SLVT_TT_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_SIMPLE_SLVT_SS_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_SIMPLE_SLVT_FF_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_SIMPLE_SRAM_TT_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_SIMPLE_SRAM_SS_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_SIMPLE_SRAM_FF_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_AO_RVT_TT_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_AO_RVT_SS_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_AO_RVT_FF_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_AO_LVT_TT_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_AO_LVT_SS_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_AO_LVT_FF_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_AO_SLVT_TT_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_AO_SLVT_SS_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_AO_SLVT_FF_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_AO_SRAM_TT_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_AO_SRAM_SS_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_AO_SRAM_FF_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_OA_RVT_TT_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_OA_RVT_SS_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_OA_RVT_FF_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_OA_LVT_TT_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_OA_LVT_SS_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_OA_LVT_FF_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_OA_SLVT_TT_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_OA_SLVT_SS_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_OA_SLVT_FF_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_OA_SRAM_TT_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_OA_SRAM_SS_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_OA_SRAM_FF_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/LIB/NLDM/asap7sc7p5t_SEQ_RVT_TT_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/LIB/NLDM/asap7sc7p5t_SEQ_RVT_SS_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/LIB/NLDM/asap7sc7p5t_SEQ_RVT_FF_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/LIB/NLDM/asap7sc7p5t_SEQ_LVT_TT_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/LIB/NLDM/asap7sc7p5t_SEQ_LVT_SS_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/LIB/NLDM/asap7sc7p5t_SEQ_LVT_FF_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/LIB/NLDM/asap7sc7p5t_SEQ_SLVT_TT_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/LIB/NLDM/asap7sc7p5t_SEQ_SLVT_SS_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/LIB/NLDM/asap7sc7p5t_SEQ_SLVT_FF_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/LIB/NLDM/asap7sc7p5t_SEQ_SRAM_TT_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/LIB/NLDM/asap7sc7p5t_SEQ_SRAM_SS_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/LIB/NLDM/asap7sc7p5t_SEQ_SRAM_FF_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_INVBUF_RVT_TT_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_INVBUF_RVT_SS_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_INVBUF_RVT_FF_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_INVBUF_LVT_TT_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_INVBUF_LVT_SS_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_INVBUF_LVT_FF_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_INVBUF_SLVT_TT_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_INVBUF_SLVT_SS_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_INVBUF_SLVT_FF_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_INVBUF_SRAM_TT_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_INVBUF_SRAM_SS_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/asap7/asap7sc7p5t_27/LIB/NLDM/asap7sc7p5t_INVBUF_SRAM_FF_nldm_201020.lib.gz
read_liberty -lib /home/chipyard/chipyard/.conda-env/lib/python3.10/site-packages/hammer/technology/asap7/sram_compiler/memories/lib/SRAM1RW2048x8_lib/SRAM1RW2048x8_PVT_0P63V_100C.lib
read_liberty -lib /home/chipyard/chipyard/.conda-env/lib/python3.10/site-packages/hammer/technology/asap7/sram_compiler/memories/lib/SRAM1RW64x21_lib/SRAM1RW64x21_PVT_0P63V_100C.lib
read_liberty -lib /home/chipyard/chipyard/.conda-env/lib/python3.10/site-packages/hammer/technology/asap7/sram_compiler/memories/lib/SRAM1RW512x32_lib/SRAM1RW512x32_PVT_0P63V_100C.lib
read_liberty -lib /home/chipyard/chipyard/.conda-env/lib/python3.10/site-packages/hammer/technology/asap7/sram_compiler/memories/lib/SRAM1RW2048x8_lib/SRAM1RW2048x8_PVT_0P77V_0C.lib
read_liberty -lib /home/chipyard/chipyard/.conda-env/lib/python3.10/site-packages/hammer/technology/asap7/sram_compiler/memories/lib/SRAM1RW64x21_lib/SRAM1RW64x21_PVT_0P77V_0C.lib
read_liberty -lib /home/chipyard/chipyard/.conda-env/lib/python3.10/site-packages/hammer/technology/asap7/sram_compiler/memories/lib/SRAM1RW512x32_lib/SRAM1RW512x32_PVT_0P77V_0C.lib
# TODO: verify this command, it was in yosys manual but not in OpenLANE script
puts "(hammer) yosys proc"
yosys proc
puts "(hammer) hierarchy -check -top ChipTop"
hierarchy -check -top ChipTop

# <--- FIX 2: CONVERT ASYNC RESETS
# Convert async FFs to sync logic, as ASAP7 has no async FFs
puts "(hammer) async2sync"
async2sync

puts "(hammer) synth -top ChipTop"
synth -top ChipTop

# Optimize the design
puts "(hammer) opt -purge"
opt -purge

# Technology mapping of latches
puts "(hammer) techmap -map /home/chipyard/chipyard/.conda-env/lib/python3.10/site-packages/hammer/technology/asap7/latch_map.v"
techmap -map /home/chipyard/chipyard/.conda-env/lib/python3.10/site-packages/hammer/technology/asap7/latch_map.v

# Technology mapping of flip-flops
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/.conda-env/lib/python3.10/site-packages/hammer/technology/asap7/sram_compiler/memories/lib/SRAM1RW2048x8_lib/SRAM1RW2048x8_PVT_0P63V_100C.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/.conda-env/lib/python3.10/site-packages/hammer/technology/asap7/sram_compiler/memories/lib/SRAM1RW2048x8_lib/SRAM1RW2048x8_PVT_0P63V_100C.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/.conda-env/lib/python3.10/site-packages/hammer/technology/asap7/sram_compiler/memories/lib/SRAM1RW64x21_lib/SRAM1RW64x21_PVT_0P63V_100C.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/.conda-env/lib/python3.10/site-packages/hammer/technology/asap7/sram_compiler/memories/lib/SRAM1RW64x21_lib/SRAM1RW64x21_PVT_0P63V_100C.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/.conda-env/lib/python3.10/site-packages/hammer/technology/asap7/sram_compiler/memories/lib/SRAM1RW512x32_lib/SRAM1RW512x32_PVT_0P63V_100C.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/.conda-env/lib/python3.10/site-packages/hammer/technology/asap7/sram_compiler/memories/lib/SRAM1RW512x32_lib/SRAM1RW512x32_PVT_0P63V_100C.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/.conda-env/lib/python3.10/site-packages/hammer/technology/asap7/sram_compiler/memories/lib/SRAM1RW2048x8_lib/SRAM1RW2048x8_PVT_0P77V_0C.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/.conda-env/lib/python3.10/site-packages/hammer/technology/asap7/sram_compiler/memories/lib/SRAM1RW2048x8_lib/SRAM1RW2048x8_PVT_0P77V_0C.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/.conda-env/lib/python3.10/site-packages/hammer/technology/asap7/sram_compiler/memories/lib/SRAM1RW64x21_lib/SRAM1RW64x21_PVT_0P77V_0C.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/.conda-env/lib/python3.10/site-packages/hammer/technology/asap7/sram_compiler/memories/lib/SRAM1RW64x21_lib/SRAM1RW64x21_PVT_0P77V_0C.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/.conda-env/lib/python3.10/site-packages/hammer/technology/asap7/sram_compiler/memories/lib/SRAM1RW512x32_lib/SRAM1RW512x32_PVT_0P77V_0C.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/.conda-env/lib/python3.10/site-packages/hammer/technology/asap7/sram_compiler/memories/lib/SRAM1RW512x32_lib/SRAM1RW512x32_PVT_0P77V_0C.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SIMPLE_SLVT_SS_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SIMPLE_SLVT_SS_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_INVBUF_RVT_TT_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_INVBUF_RVT_TT_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_AO_RVT_SS_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_AO_RVT_SS_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_INVBUF_LVT_TT_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_INVBUF_LVT_TT_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SIMPLE_SLVT_TT_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SIMPLE_SLVT_TT_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_AO_SRAM_SS_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_AO_SRAM_SS_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_AO_LVT_FF_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_AO_LVT_FF_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SEQ_RVT_TT_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SEQ_RVT_TT_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SEQ_LVT_FF_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SEQ_LVT_FF_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SIMPLE_SLVT_FF_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SIMPLE_SLVT_FF_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_AO_SRAM_TT_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_AO_SRAM_TT_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_INVBUF_SLVT_TT_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_INVBUF_SLVT_TT_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_AO_LVT_SS_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_AO_LVT_SS_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_OA_LVT_FF_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_OA_LVT_FF_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_INVBUF_LVT_FF_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_INVBUF_LVT_FF_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_INVBUF_SRAM_SS_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_INVBUF_SRAM_SS_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SIMPLE_RVT_SS_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SIMPLE_RVT_SS_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SIMPLE_RVT_TT_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SIMPLE_RVT_TT_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_AO_LVT_TT_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_AO_LVT_TT_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_AO_SRAM_FF_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_AO_SRAM_FF_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SEQ_SLVT_TT_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SEQ_SLVT_TT_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_OA_SRAM_SS_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_OA_SRAM_SS_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_INVBUF_SRAM_FF_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_INVBUF_SRAM_FF_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SIMPLE_RVT_FF_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SIMPLE_RVT_FF_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_OA_LVT_SS_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_OA_LVT_SS_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_INVBUF_SLVT_FF_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_INVBUF_SLVT_FF_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_AO_SLVT_TT_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_AO_SLVT_TT_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_OA_RVT_TT_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_OA_RVT_TT_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SIMPLE_LVT_FF_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SIMPLE_LVT_FF_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SIMPLE_SRAM_SS_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SIMPLE_SRAM_SS_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SEQ_RVT_FF_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SEQ_RVT_FF_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SIMPLE_LVT_SS_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SIMPLE_LVT_SS_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SEQ_LVT_TT_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SEQ_LVT_TT_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_AO_RVT_TT_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_AO_RVT_TT_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_OA_SLVT_FF_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_OA_SLVT_FF_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SIMPLE_LVT_TT_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SIMPLE_LVT_TT_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SEQ_SLVT_FF_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SEQ_SLVT_FF_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SEQ_RVT_SS_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SEQ_RVT_SS_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_AO_RVT_FF_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_AO_RVT_FF_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_AO_SLVT_SS_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_AO_SLVT_SS_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_INVBUF_LVT_SS_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_INVBUF_LVT_SS_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_OA_SRAM_TT_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_OA_SRAM_TT_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_OA_SRAM_FF_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_OA_SRAM_FF_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SEQ_SLVT_SS_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SEQ_SLVT_SS_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SEQ_SRAM_TT_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SEQ_SRAM_TT_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_OA_RVT_FF_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_OA_RVT_FF_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_OA_RVT_SS_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_OA_RVT_SS_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_OA_LVT_TT_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_OA_LVT_TT_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SEQ_LVT_SS_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SEQ_LVT_SS_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_OA_SLVT_TT_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_OA_SLVT_TT_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SIMPLE_SRAM_TT_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SIMPLE_SRAM_TT_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_OA_SLVT_SS_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_OA_SLVT_SS_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_INVBUF_SRAM_TT_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_INVBUF_SRAM_TT_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SEQ_SRAM_FF_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SEQ_SRAM_FF_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SIMPLE_SRAM_FF_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SIMPLE_SRAM_FF_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_INVBUF_RVT_FF_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_INVBUF_RVT_FF_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_INVBUF_SLVT_SS_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_INVBUF_SLVT_SS_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_AO_SLVT_FF_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_AO_SLVT_FF_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_INVBUF_RVT_SS_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_INVBUF_RVT_SS_nldm_201020.lib
puts "dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SEQ_SRAM_SS_nldm_201020.lib" 
dfflibmap -map-only -liberty /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/tech-asap7-cache/extracted_tarfiles/asap7sc7p5t_SEQ_SRAM_SS_nldm_201020.lib
puts "opt" 
opt
# Technology mapping for cells
# ABC supports multiple liberty files, but the hook from Yosys to ABC doesn't
# TODO: this is a bad way of getting one liberty file, need a way to merge all std cell lib files
puts "(hammer) abc -D 1000"
abc -D 1000 \
    -constr "/home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/syn-rundir/ChipTop.mapped.sdc" \
    -liberty "/home/chipyard/chipyard/.conda-env/lib/python3.10/site-packages/hammer/technology/asap7/sram_compiler/memories/lib/SRAM1RW2048x8_lib/SRAM1RW2048x8_PVT_0P63V_100C.lib" \
    -showtmp

# Replace undef values with defined constants
# TODO: do we need this??
puts "(hammer) setundef -zero"
setundef -zero

# Split multi-bit nets into single-bit nets.
# Splitting nets resolves unwanted compound assign statements in netlist (assign [..] = [..])
puts "(hammer) splitnets"
splitnets

# Remove unused cells and wires
puts "(hammer) opt_clean -purge"
opt_clean -purge
puts "(hammer) tee -o /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/syn-rundir/ChipTop.synth_check.rpt check"
tee -o /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/syn-rundir/ChipTop.synth_check.rpt check

puts "(hammer) tee -o /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/syn-rundir/ChipTop.synth_stat.txt stat -top ChipTop -liberty /home/chipyard/chipyard/.conda-env/lib/python3.10/site-packages/hammer/technology/asap7/sram_compiler/memories/lib/SRAM1RW2048x8_lib/SRAM1RW2048x8_PVT_0P63V_100C.lib"
tee -o /home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/syn-rundir/ChipTop.synth_stat.txt stat -top ChipTop -liberty /home/chipyard/chipyard/.conda-env/lib/python3.10/site-packages/hammer/technology/asap7/sram_compiler/memories/lib/SRAM1RW2048x8_lib/SRAM1RW2048x8_PVT_0P63V_100C.lib
puts "(hammer) write_verilog -noattr -noexpr -nohex -nodec -defparam \"/home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/syn-rundir/ChipTop.mapped.v\""
write_verilog -noattr -noexpr -nohex -nodec -defparam "/home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/syn-rundir/ChipTop.mapped.v"

# flatten

# # OpenROAD will throw an error if the verilog from Yosys is not flattened
# # UPDATE ON THIS: nvm, it somehow works now...
# write_verilog -noattr -noexpr -nohex -nodec -defparam "/home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/syn-rundir/ChipTop.mapped.v"

# BLIF file seems to be easier to parse than mapped verilog for find_regs functions so leave for now
# write_blif -top ChipTop "/home/chipyard/chipyard/vlsi/build-asap7/chipyard.harness.TestHarness.TinyRocketConfig-ChipTop/syn-rundir/ChipTop.mapped.blif"
exit